#include "ucos_ii.h"
#include <stm32f4xx.h>

#define LEISAI_OFFSET 256

typedef struct
{
	s32 kp;
	s32 ki;
	s32 kd;	
}PIDPreParamTyp;

typedef struct
{
	//最小测试电压(mV)
	s32 MinVol;
	//最大测试电压
	s32 MaxVol;
	//[(60V下最大值-60V下最小值)-(24V下最大值-24V下最小值)]*100/(60V-24V)
 	s32 Slope;	
	//24V下初始值		
	s16 StartValue;
	//电机极对数
	u8 MotorPairNum;
	//电机默认编码器线数
	u16 MotorEncoderNum;
	PIDPreParamTyp PreTorquePIDParams;
	PIDPreParamTyp PreSpeedPIDParams;
	PIDPreParamTyp PrePositionPIDParams;
}MotorModelTyp;

/* 四宏电机参数列表 -------------------------------------------------------*/
MotorModelTyp MotorModel_SiHong[] = {
	//0:57BZ110-340-1000Z
	{24000, 60000, 1,    0,    2, 1000, {350000, 16000, 0}, {18000, 300, 0},  {4000000, 0, 0}},
	//1:86BL100-440-1000Z
	{24000, 60000, 8640, 2045, 4, 1000, {80000, 2000, 0},   {20000, 1000, 0}, {4000000, 0, 0}},
	//2:SH42BLDC-002-1000Z
	{24000, 60000, 5025, 1132, 4, 1000, {350000, 16000, 0}, {18000, 300, 0},  {4000000, 0, 0}},
	//3:SH42BLDC-001-1000Z
	{24000, 60000, 1900, 344,  4, 1000, {350000, 16000, 0}, {10000, 200, 0},  {4000000, 0, 0}},
	//4:60SF3A110-440-1000Z-03
	{24000, 60000, 5672, 1282, 4, 1000, {350000, 16000, 0}, {25000, 800, 0},  {4000000, 0, 0}},
};

/* 雷塞电机参数列表 -------------------------------------------------------*/
MotorModelTyp MotorModel_LeiSai[] = {
	//256:BLM57180-1000Z
	{24000, 60000, 1833, 347, 2, 1000, {131871, 3571, 0}, {20000, 1000, 0}, {4000000, 0, 0}},
	//257:BLM57050-1000Z
	{24000, 60000, 1083, 162, 2, 1000, {131871, 3571, 0}, {20000, 800, 0},  {4000000, 0, 0}},
	//258:BLM57090-1000Z
	{24000, 60000, 1,    0,   2, 1000, {131871, 3571, 0}, {20000, 1000, 0}, {4000000, 0, 0}},
	//259:BLM57025-1000Z
	//260:ACM602V36-2500Z
	//261:ACM602V60-2500Z
};
